"""
GIT


https://git-scm.com/book/ru/v1/%D0%92%D0%B2%D0%B5%D0%B4%D0%B5%D0%BD%D0%B8%D0%B5-%D0%9E%D1%81%D0%BD%D0%BE%D0%B2%D1%8B-Git
-- Централизованные
SVN
-repo 1

-- Распределенная система
GIT
-repo n n = count of developers




проверка гита на наличие
команда git в консоли



АРГУМЕНТЫ
-- полное имя
или -

конструкция команды
cmd --argument=   ==help -h


папку .git не удалять - папка локального репозитория


присоединение к проекту (получить существующий) - делать гитклон из общего репозитория, преобразовывать в локальный
git init
git clone url

git add - добавление файлов в индекс

git commit и обязательно конструкцию -m


git log
первые 7 символов - хэш коммита, по нему его можно искать

"""
